package com.szse.po.sentiment.analysis.process;
import java.util.*;
public class Main {

	/**
	 * @param args
	 */
	public static void main(String[] args) {
		// TODO Auto-generated method stub

		SumCalculation sumcal=new SumCalculation();
		sumcal.dicInit(Config.ROOT_PATH);
		ArrayList<int[]> result=sumcal.scoreParagragh("罗牛山腐败案事实真相利空风险 风险红色警报 罗牛山重大利空及非系统性风险 2015年9月9日/胥中钊、杨明弘  主送：中国证监会並发行监管部、稽查局 抄报：中央纪委、最高人民检察院、海南省人民检察院、重庆市人民检察院  [案由][截至2015年9月9日止罗牛山案举报材料清单]  一 罗牛山高管涉嫌公开发行股票与上市重、特大证券欺诈腐败案[渉案7亿元] 二 罗牛山高管涉嫌对反腐败举报人、证人胥中钊、杨明弘之子胥杨的买凶报复谋杀案 三 罗牛山高管涉嫌非公开、秘密、违规转让广济药业限售流通股内幕交易案[渉案6亿元]  [截至2015年9月9日止罗牛山案举报材料清单] —、反腐败举报举证控告材料及特别申请文件/正文：53个证据/154页及照片、视听资料证据 罗牛山腐败案对反腐败举报人、证人胥中钊、杨明弘之子胥杨的买凶报复谋杀案举报控告文件正文  二、反腐败举报举证控告材料及特别申请文件/附件1………附件23 罗牛山腐败案对反腐败举报人、证人胥中钊、杨明弘之子胥杨的买凶报复谋杀案举报控告文件附件目录索引  1、关于朱明国对罗牛山买凶报复谋杀案有案不立，压案不查，，瞒案不报，命案不破，百般包庇的控告 2、关于朱明国对举报人、被害人父母亲胥中钊、杨明弘进行打击报复，枉法将其打成精神病，帮助罗牛山吴伟雄等犯罪嫌疑人逃避法律制裁的控告 3、罗牛山腐败案、对举报人之子的买凶报复谋杀案特别重要补充举报：罗牛山腐败案、买凶报复案尘封十五年的秘密档案： 《半月谈》2000年第11期“罗牛山的困惑”： 新华社海南分社：《海南内参》2000年第12期 《肆意诬告缠讼 小报推波助澜 “罗牛山”股份公司受到严重干扰》 4、罗牛山违反证券、法律法规十九个方面的问题及线索  5、南方都市报《罗牛山调查》 6、罗牛山欺诈上市后通过所谓的改制，空手套白狼，将罗牛山农场私有化，导致国有资产（国有股权）严重流失  7、中国证券监督管理委员会关于海南省证券管理办公室违反证券法规行为的通报批评  　　 (1998年5月26日 证监查字[1998]42号 ) 关于海口农工贸（罗牛山）股份有限公司 海南大正会计师事务所违反证券法规行为的处罚决定  　　 (1998年5月26日 证监查字[1998]43号) 8、《“蛊惑公司”为何惧怕史美伦》/罗牛山欺诈上市已构成犯罪 9、 心碎的痛-反腐败、反谋杀－－胥杨网上纪念网站首页/准入密码“456123”  10、损伤比对证据(详见胥扬网上纪念网站网址： 历史相册第2页彩色照片) 11、《大陆4000外逃贪官海外生态调查》/罗牛山涉案贪官富荣武已潜逃海外 ；打开一个贪官的卷宗——海口市公安局原副局长丰凯犯罪实录  12、《北京晨报》、《新浪财经》、《中国证券市场周刊 》、《上海青年报》、《证券市场周刊》相关新闻报道(五篇) 13、罗牛山利益集团欺诈发行证券、股票欺诈上市—条龙疯狂造假严重违法违规事实 14、有新的证据证明：罗牛山全方位疯狂造假的时间是在１９９７年１月到５月期间 15、关于罗牛山涉嫌证券欺诈犯罪立案申请书  16、重庆直辖巿五家新闻媒体的专题报道《现代工人报》《重庆经济报》《重庆晨报》《重庆晚报》《重庆法制报》 17、罗牛山腐败案买凶报复谋杀案[案情回放、重大案情掲示] 18、关于原重庆市委常委、政法委书记，市公安局局长朱明国包庇罗牛山买凶报复谋杀案给中央纪委、最高人民检察院、中国证监会的举报控告 19、罗牛山没有依法公开信息披露：深圳证券交易所以下处分决定，隐瞒至今长达七年之久，包括：1、2008年8月6日《深圳证券交易所处分事先告知书》公司部处分告知函[2008]13号； 2、深圳证券交易所正式的处分决定 20、关于海口市政协副主席、罗牛山董事长兼总经理吴伟雄涉嫌罗牛山证券欺诈腐败案、对举报人之子的买凶报复谋杀案给中共海南省纪委、海南省检察院领导同志並请转呈罗书记、刘省长的举报控告信 21：《关于请求中国证监会依法冻结罗牛山公司本年度非公开发行股票(定向增发)的特别申请》 22、《罗牛山高管涉嫌非公开、秘密、违规转让广济药业限售流通股内幕交易案[渉案6亿元]》 23、《 罗牛山股东对广济药业股权转让的质疑之一二三》  2015年9月9日/胥中钊、杨明弘  主送：中国证监会並发行监管部、稽查局 抄报：中央纪委、最高人民检察院、海南省人民检察院、重庆市人民检察院 …………………………………………………………………………………… 鼎力举报、合力肃贪  心碎的痛-反腐败、反谋杀－－胥杨网上纪念网站首页/准入密码“456123”  欢迎登录本纪念网站/更多资讯证据请点击历史相册、纪念文选等网页  http://www.netor.com/m/box200609/m67667.asp?BoardID=67667  　　  鼎力举报--2006年10月26日北京国际反贪局联合会成立之日特别纪念  合力肃贪--2006年10月26日被害人胥杨诞辰二十五周年纪念日特别举证   胥杨，男，1981年10月26日岀生，1988年9月至1997年8月在国营重庆重型铸锻厂职工子弟中学小学部、初中部学习，连年被评为优等生、三好学生、先进个人、优秀学生干部，曾获全国奥林匹克奖、五市数学竞赛奖、作文竞赛奖等。爱好音乐（唱歌、小提琴）、体育（足球、围棋）。1997年9月考入重庆市巴蜀中学（高一3班学生）。  1998年8月11日，胥杨因其父亲胥中钊(原罗牛山公司首届董事会秘书长、证券部经理兼办公室主任)反腐败（罗牛山公开发行股票与上市重、特大腐败案/深交所股票代码000735），而导致其被时任海口市政协副主席、罗牛山董事长兼总经理吴伟雄（现海南省农村信用社联合社理事长）、胡电铃、李豫等人买凶报复谋杀致死（全身被一条长达13.6米的绳索五花大绑，双手反绑，并被一黑色皮带再次捆绑，全身上下总计十二处抵抗伤、搏斗伤、外来暴力伤，被腐败分子他缢、他杀）。   案发后的1999年2月，罗牛山李豫在海口罗牛山公司办公场合公然宣称“吴伟雄叫我找了几个人，去教训修理了胥中钊，因为他告了我们罗牛山的状”，道出了买凶报复杀人案的杀人动机.目的.主谋.凶手及目标对象。同年4月.6月，罗牛山公司的几位富有正义感的知情人将此案情用特快专递向重庆警方及被害人家属紧急举报。   案发后的1999年7月，时任海南省委常委、副省长，省委政法委书记的朱明国，接受吴伟雄的请托，违反办案管辖的规定，指派其下属海口市公安局原副局长兼刑侦处处长、刑侦支队支队长的丰凯（现已因受贿罪.巨额财产来源不明罪被判处无期徒刑.剥夺政治权利终身）,派二人专案组，赴案发地重庆市江北区公安分局，名为调查取证，实为打探消息，疏通关係，充当说客。  对此，罗牛山吴伟雄.胡电铃向时任海口市公安局原副局长兼刑侦处处长、刑侦支队支队长的丰凯行贿200万元，以寻求其“保护伞”，以逃避法律的制裁。详见《今日海南》（中共海南省委主办）2004年第10期《大案警示：打开一个贪官的卷宗——海口市公安局原副局长丰凯犯罪实录》。   案发后的1999年11月，重庆市江北区公安分局也派出三人专案组赴海口市罗牛山进行了为期九天的刑事侦查。返渝后，公安办案人员（重庆市江北区公安分局主管刑侦工作的副局长戴月高），向死者家属索要2.5万元“办案费”遭拒绝后，时到今日，重庆市公安机关有案不立、压案不查、命案不破、瞒案不报，已长达17年之久。   案发后，重庆市公安机关拒绝正式立案侦查，被害人父母胥中钊、杨明弘不服1998年9月7日重庆法医学会（对内为重庆市公安局刑警总队技术处法医技术室） 尸检初次鉴定仅揭示五处损伤，漏检七处损伤，漏检率百分之五十八；不服案发近6年后的2004年5月26日公安部物证鉴定中心尸检重新鉴定仅揭示一处损伤，漏检十一处损伤，漏检率百分之九十二（2006年5月26日重庆市江北区公安分局当天委托、公安部物证鉴定中心当天受理、当天就出具尸检重新鉴定报告），申请委托最高人民检察院进行尸检复核鉴定，但重庆市江北区公安分局以“最高人民检察院无检察技术科学研究所（检察技术信息研究中心），且最高人民检察院也不回复其发出的《咨询函》”为借口，拒绝委托最高人民检察院检察技术信息研究中心进行尸检复核鉴定，以此来逃避虚假鉴定.隐匿他缢.他杀证据.作伪证.妨害司法公正的法律责任及错案责任追究。   鉴于罗牛山公开发行股票与上市重、特大证券欺诈腐败案（涉嫌经济犯罪总案值高达7.65亿元,包括徇私舞弊，弄虚作假，在1997年1至4月欺诈上市之前非法、擅自、突击、临时追加发行总额高达1125万股内部职工股，");
		//System.out.println(result[0]+","+result[1]);
		
		//Average Calculation
		int pos=0,neg=0;
		for(int[] seg:result)
		{
			pos+=seg[0];
			neg+=seg[1];
		}
		double posAverage=pos/(result.size()+0.0);
		double negAverage=neg/(result.size()+0.0);
		
		
		//Variance calculation
		double posVariance=0;
		double negVariance=0;
		for(int[] seg:result)
		{
			posVariance+=(seg[0]-posAverage)*(seg[0]-posAverage);
			negVariance+=(seg[1]-negAverage)*(seg[1]-negAverage);
		}
		posVariance/=result.size();
		negVariance/=result.size();
		
		//Simplify Result
		int posSimp=0,negSimp=0;
		if(posAverage==negAverage&&posAverage!=0)
		{
			posSimp=1;
			negSimp=1;
		}
		else if(posAverage==negAverage&&posAverage==0)
		{
			posSimp=0;
			negSimp=0;
		}
		else if(posAverage>negAverage)
		{
			posSimp=1;
			negSimp=0;
		}
		else
		{
			posSimp=0;
			negSimp=1;
		}
		
		
		//Output Result
		
		System.out.println("Overall Average:"+posAverage+","+negAverage);
		System.out.println("Overall Variance:"+posVariance+","+negVariance);
		System.out.println("Simplified Result:"+posSimp+","+negSimp);
		
	}

}
